import React from "react";
import Navbar from "../../components/navbar/Navbar"
import Footer from "../../components/footer/Footer"
import ScrollToTop from "../../components/scrollToTop/ScrollToTop";
import './StudyDuration.css'
import PriorityHighIcon from '@mui/icons-material/PriorityHigh';

const StudyDuration = () => {
    return (
        <div>
            <Navbar/>

            {/*--------- Breadcrumbs -------> */}
            <section id="breadcrumbs" className="breadcrumbs">
                    <div className="container">
                        <div className="d-flex justify-content-between align-items-center">
                            <ol>
                                <li><a href="/"><i className="icofont-home"></i></a></li>
                                <li>Φοιτητές/τριες</li>
                                <li>Θέματα Φοίτησης</li>
                                <li>Ανώτατη Διάρκεια Φοίτησης</li>
                            </ol>
                        </div>
                    </div>
                </section>
            {/*--------- Breadcrumbs -------> */}

            <div className="study-duration-title">
                <h2>Ανώτατη Διάρκεια Φοίτησης</h2>
            </div>

            <table className="study-duration-table-container">
                <thead>
                <tr>
                    <th>Ακαδημαικό έτος <br/> εισαγωγής</th>
                    <th>ΔΙΑΓΡΑΦΗ στη ΛΗΞΗ <br/> συμπεριλαμβανομένης <br/> της επαναληπτικής <br/> εξεταστικής του <br/> Σεπτεμβρίου</th>
                    <th>Νομοθεσία</th>
                    <th></th>
                </tr>
                </thead>

                <thead>
                <tr>
                    <th></th>
                    <th></th>
                    <th>Ν. 4957/2022 <br/>(ΦΕΚ 141/21-7-2022 τ.Α’)</th>
                    <th></th>
                </tr>
                </thead>

                <tbody>
                    <tr>
                        <td>2022-23</td>
                        <td>2027-28</td>
                        <td>άρθρο 76 <br/> και άρθρο 454,<br/> παρ. 3</td>
                        <td>Η ανώτατη διάρκεια φοίτησης σε ένα πρόγραμμα σπουδών πρώτου κύκλου με ελάχιστη <br/> διάρκεια οκτώ (8) ακαδημαϊκών εξαμήνων για την απονομή του τίτλου σπουδών, είναι ο <br/> χρόνος αυτός, προσαυξημένος κατά τέσσερα (4) ακαδημαϊκά εξάμηνα. Μετά από τη <br/> συμπλήρωση της ανώτατης διάρκειας φοίτησης, με την επιφύλαξη των επόμενων <br/> παραγράφων, το Διοικητικό Συμβούλιο του Τμήματος εκδίδει πράξη διαγραφής. <br/> Η ανώτατη χρονική διάρκεια σπουδών, όπως ορίζεται στο άρθρο 76 καταλαμβάνει τους <br/> φοιτητές που εισάγονται στα Α.Ε.Ι. από το ακαδημαϊκό έτος 2022-2023 και εξής.</td>
                    </tr>

                    <tr>
                        <td>2021-22 <br/><br/> 2020-21 <br/><br/> 2019-20 <br/><br/> 2018-19 <br/><br/> 2017-18</td>
                        <td>2026-27</td>
                        <td>άρθρο 454,<br/> παρ. 3</td>
                        <td>Όσοι φοιτητές δεν είχαν υπερβεί την ελάχιστη χρονική διάρκεια φοίτησης του <br/> προγράμματος σπουδών τους κατά τη δημοσίευση του ν. 4777/2021, εφαρμόζεται ο <br/> υπολογισμός της ανώτατης διάρκειας φοίτησης της παρ. 1 του άρθρου 76 από την έναρξη <br/> του ακαδημαϊκού έτους 2021-2022 και έπειτα</td>
                    </tr>

                    <tr>
                        <td>1989-90 έως <br/> 2016-17</td>
                        <td>2024-25</td>
                        <td>άρθρο 454,<br/> παρ. 3</td>
                        <td>Οι φοιτητές που ήταν εγγεγραμμένοι σε προγράμματα σπουδών πρώτου κύκλου των Α.Ε.Ι.,<br/> κατά την έναρξη ισχύος του ν. 4777/2021 και είχαν υπερβεί την ελάχιστη χρονική διάρκεια <br/> φοίτησης του προγράμματος σπουδών, διαθέτουν για την ολοκλήρωση των σπουδών τους <br/> χρόνο ίσο προς την ελάχιστη χρονική διάρκεια φοίτησης, από την έναρξη του ακαδημαϊκού <br/> έτους 2021-2022 και εξής, χωρίς δικαίωμα προσαύξησης του χρόνου φοίτησης κατά την <br/> παρ. 1 του άρθρου 76</td>
                    </tr>
                
                </tbody>
            </table>

            <div className="study-duration-frame">
                <span className="study-duration-1">
                    <PriorityHighIcon style={{ verticalAlign: 'middle', marginBottom: '5px' }}/>
                    Υπέρβαση ανώτατης χρονικής διάρκειας Φοίτησης
                </span>
                <span>Με τον εσωτερικό κανονισμό του Ανώτατου Εκπαιδευτικού Ιδρύματος (Α.Ε.Ι.) καθορίζονται οι <br/> διαδικαστικές λεπτομέρειες και τα δικαιολογητικά για την κατ’ εξαίρεση υπέρβαση της <br/> ανώτατης χρονικής διάρκειας φοίτησης της παρ. 1 για σοβαρούς λόγους υγείας που ανάγονται <br/> στο πρόσωπο του φοιτητή ή στο πρόσωπο συγγενούς πρώτου βαθμού εξ αίματος ή συζύγου ή <br/> προσώπου με το οποίο ο φοιτητής έχει συνάψει σύμφωνο συμβίωσης.</span>
            </div>

            <ScrollToTop/>
            <Footer/>

        </div>
    )
}

export default StudyDuration