import React from "react";
import './StudyInfo.css'
import Navbar from "../../components/navbar/Navbar"
import Footer from "../../components/footer/Footer"
import ScrollToTop from "../../components/scrollToTop/ScrollToTop";

import PropTypes from 'prop-types';
import Tabs from '@mui/material/Tabs';
import Tab from '@mui/material/Tab';
import Typography from '@mui/material/Typography';
import Box from '@mui/material/Box';

function CustomTabPanel(props) {
  const { children, value, index, ...other } = props;

  return (
    <div
      role="tabpanel"
      hidden={value !== index}
      id={`simple-tabpanel-${index}`}
      aria-labelledby={`simple-tab-${index}`}
      {...other}
    >
      {value === index && (
        <Box sx={{ p: 3 }}>
          <Typography>{children}</Typography>
        </Box>
      )}
    </div>
  );
}

CustomTabPanel.propTypes = {
  children: PropTypes.node,
  index: PropTypes.number.isRequired,
  value: PropTypes.number.isRequired,
};

function a11yProps(index) {
  return {
    id: `simple-tab-${index}`,
    'aria-controls': `simple-tabpanel-${index}`,
  };
}

const FirstTag = () => {
    return (

        <div>
            {/*--------- Breadcrumbs -------> */}
            <section id="breadcrumbs" className="breadcrumbs">
                <div className="container">
                    <div className="d-flex justify-content-between align-items-center">
                        <ol>
                            <li><a href="/"><i className="icofont-home"></i></a></li>
                            <li>Φοιτητές/τριες</li>
                            <li>Θέματα Φοίτησης</li>
                            <li>Βασικά Φοίτησης</li>
                            <li>Αναστολή Φοίτησης</li>
                        </ol>
                    </div>
                </div>
            </section>
            {/*--------- Breadcrumbs -------> */}
        

        <div className="first-tag-info">
        
            <h2>Αναστολή φοίτησης</h2>
            
            <p>
                Σύμφωνα με τις διατάξεις του Νόμου 4777/2021 (ΦΕΚ 25/19-2-2021 τ.Α’) άρθρο 34 παρ.4 όπως τροποποιήθηκε με τον Νόμο 4957/2022 (ΦΕΚ 141/21-7-2022 τ.Α’) άρθρο 76 παρ. 4 «οι φοιτητές που δεν έχουν υπερβεί το ανώτατο όριο φοίτησης της παρ. 1 (ν+2), δύνανται, μετά από αίτησή τους προς την Γραμματεία του Τμήματος, να διακόψουν τη φοίτησή τους, για χρονική περίοδο που δεν υπερβαίνει τα (2) δύο έτη. Το δικαίωμα διακοπής της φοίτησης δύναται να ασκηθεί άπαξ ή τμηματικά για χρονικό διάστημα κατ’ ελάχιστον ενός (1) ακαδημαϊκού εξαμήνου, αλλά η διάρκεια της διακοπής δεν δύναται να υπερβαίνει αθροιστικά τα δύο (2) έτη αν χορηγείται τμηματικά. Η φοιτητική ιδιότητα αναστέλλεται κατά τον χρόνο διακοπής της φοίτησης και δεν επιτρέπεται η συμμετοχή σε καμία εκπαιδευτική διαδικασία. Το δικαίωμα διακοπής της φοίτησης αναστέλλεται κατά τον χρόνο διακοπής της φοίτησης»
            </p>
    
            <span>Διαδικασία:</span>

            <p>
                Οι φοιτητές με αίτησή τους στην έναρξη του ακαδημαϊκού έτους* που σκοπεύουν να αιτηθούν αναστολή φοίτησης υποβάλλουν στην Γραμματεία του Τμήματος αίτηση μέσω της ιστοσελίδας <a href="https://eprotocol.uoa.gr" target="_blank" rel="noopener noreferrer">https://eprotocol.uoa.gr</a> επιλέγοντας την αίτηση: 18 Αίτηση για αναστολή φοίτησης και επισυνάπτοντας όλα τα σχετικά δικαιολογητικά από τα οποία αποδεικνύονται:
            </p>

            <ul>
                <li>σοβαροί λόγοι υγείας: του αιτούντος ή συγγενών του μέχρι και δευτέρου βαθμού εξ αίματος βεβαίωση αρμόδιων δημόσιων αρχών ή οργανισμών,</li>
                <li>λόγοι στράτευσης: πρόσκληση κατάταξης</li>
                <li>σοβαροί οικονομικοί λόγοι</li>
            </ul>
    
            <span>Διαδικασία:</span>
                
            <p>
                Η αίτηση εγκρίνεται από την Συνέλευση του Τμήματος. Η φοιτητική ιδιότητα διακόπτεται προσωρινά κατά τον χρόνο διακοπής της φοίτησης, εκτός αν η διακοπή οφείλεται σε αποδεδειγμένους λόγους υγείας.
            </p>

            <p>
                Κατά την διάρκεια αναστολής φοίτησης ακυρώνεται η ακαδημαϊκή ταυτότητα (πάσο), ο φοιτητής χάνει την πρόσβαση στο my-studies και δεν μπορεί να εξεταστεί μαθήματα και να παραλάβει συγγράμματα για το διάστημα αυτό.
                Τα εξάμηνα αυτά δεν προσμετρώνται στην ανώτατη διάρκεια φοίτησης. Μετά τη λήξη της διακοπής των σπουδών οι φοιτητές επανέρχονται στο Τμήμα.
                Η άρση της διακοπής φοίτησης είναι δυνατή με την ίδια ως άνω διαδικασία.
                Σε αυτήν την περίπτωση, για την απρόσκοπτη συνέχιση της φοίτησης του φοιτητή κατά την επάνοδό του, η διακοπή της αναστολής δεν μπορεί να πραγματοποιηθεί σε μονό αριθμό εξαμήνων
            </p>
    
            <span className="first-tag-info-span">*Διευκρινήσεις:</span>
            
            <ul>
                <li>Για τους πρωτοετείς φοιτητές, εντός της οριζόμενης προθεσμίας για την εγγραφή τους στο Τμήμα μας.</li>
                <li>Για τους ενεργούς φοιτητές του δεύτερου (2ου) και άνω ακαδημαϊκού εξαμήνου το πρώτο δεκαπενθήμερο κάθε ακαδημαϊκού εξαμήνου.</li>
            </ul>

            <p>
                Σε εξαιρετικές περιπτώσεις και για λόγους αναγόμενους σε ανωτέρα βία είναι δυνατή η υποβολή της αίτησης και μετά την πάροδο των ανωτέρων προθεσμιών.
            </p>
        </div>

        </div>
    );
};


const listStyle = {
    listStyleType: 'none',
};


const SecondTag = () => {
    return (

        <div>
            {/*--------- Breadcrumbs -------> */}
            <section id="breadcrumbs" className="breadcrumbs">
            <div className="container">
                <div className="d-flex justify-content-between align-items-center">
                    <ol>
                        <li><a href="/"><i className="icofont-home"></i></a></li>
                        <li>Φοιτητές/τριες</li>
                        <li>Θέματα Φοίτησης</li>
                        <li>Βασικά Φοίτησης</li>
                        <li>Μερική Φοίτηση</li>
                    </ol>
                </div>
            </div>
            </section>
            {/*--------- Breadcrumbs -------> */}

            <div className="second-tag-info">

                <h2>Μερική Φοίτηση</h2>

                <p>
                    Οι φοιτητές μπορούν να ενταχθούν σε καθεστώς μερικής φοίτησης (σύμφωνα με τα οριζόμενα στο άρθρο 34 του ν. 4777/2021, ΦΕΚ 25/17.2.21, τ.Α όπως τροποποιήθηκε και ισχύει με το άρθρο 79 του ν. 4957/2023 ΦΕΚ 141/21.7.22, τ.Α καθώς και την 981 Απόφαση Συγκλήτου ΕΚΠΑ, ΦΕΚ 133/19.01.2022, τ.Β) εφόσον ανήκουν στις εξής κατηγορίες:
                </p>

                α) φοιτητές που αποδεδειγμένα εργάζονται τουλάχιστον 20 ώρες την εβδομάδα, <br/>
                β) φοιτητές με αναπηρία και ειδικές εκπαιδευτικές ανάγκες, <br/>
                γ) οι φοιτητές που είναι παράλληλα αθλητές και κατά τη διάρκεια των σπουδών τους ανήκουν σε αθλητικά σωματεία εγγεγραμμένα στο ηλεκτρονικό μητρώο αθλητικών σωματείων του άρθρου 142 του ν. 4714/2020 (Α’ 148), που τηρείται στη Γενική Γραμματεία Αθλητισμού (Γ.Γ.Α.) υπό τις ακόλουθες προϋποθέσεις: <br/>
                <ul>
                    <li>γα) για όσα έτη καταλαμβάνουν διάκριση 1ης έως και 8ης θέσης σε πανελλήνια πρωταθλήματα ατομικών αθλημάτων με συμμετοχή τουλάχιστον δώδεκα (12) αθλητών και οκτώ (8) σωματείων ή αγωνίζονται σε ομάδες των δύο (2) ανώτερων κατηγοριών σε ομαδικά αθλήματα ή συμμετέχουν ως μέλη εθνικών ομάδων σε πανευρωπαϊκά πρωταθλήματα, παγκόσμια πρωταθλήματα ή άλλες διεθνείς διοργανώσεις υπό την Ελληνική Ολυμπιακή Επιτροπή, ή</li>
                    <li>γβ) συμμετέχουν έστω άπαξ, κατά τη διάρκεια της φοίτησής τους στο πρόγραμμα σπουδών για το οποίο αιτούνται την υπαγωγή τους σε καθεστώς μερικής φοίτησης, σε ολυμπιακούς, παραολυμπιακούς αγώνες και ολυμπιακούς αγώνες κωφών.</li>
                </ul>

                <span className="second-tag-info-title">Διαδικασία:</span>

                <p>
                    Οι φοιτητές υποβάλλουν αίτηση στην Γραμματεία του Τμήματος στην έναρξη κάθε  ακαδημαϊκού έτους μετά από σχετική ανακοίνωση μέσω ηλεκτρονικού πρωτοκόλλου στην ιστοσελίδα <a href="https://eprotocol.uoa.gr" target="_blank" rel="noopener noreferrer">https://eprotocol.uoa.gr</a> (κάνοντας σύνδεση με τον ακαδημαϊκό τους λογαριασμό, δηλαδή με το user name και password που χρησιμοποιούν για την είσοδό τους στο <a href="https://my-studies.uoa.gr" target="_blank" rel="noopener noreferrer">https://my-studies.uoa.gr</a>) επιλέγοντας την αίτηση <span className="secong-tag-info-p-span">01.Γενική Αίτηση για Φοιτητικά Θέματα,</span>  συμπληρώνοντας στο πεδίο: «Παρακαλώ να κάνετε δεκτή την αίτηση μου για……»  και συμπληρώνοντας «υπαγωγή σε καθεστώς μερικής φοίτησης» καθώς και τον αντίστοιχο λόγο πχ. «εργαζόμενος φοιτητής», προσκομίζοντας τα απαραίτητα κατά περίπτωση δικαιολογητικά:
                </p>

                <ul>
                    <li><span className="secong-tag-info-p-span">Εργαζόμενοι φοιτητές:</span> Βεβαίωση από την Υπηρεσία (εφόσον πρόκειται για Δημόσια Υπηρεσία)  ή Υπεύθυνη δήλωση του εργοδότη που εκδίδεται μέσω gov.gr (εναλλακτικά η βεβαίωση θα πρέπει να είναι θεωρημένη με το γνήσιο της υπογραφής), ότι ο φοιτητής εργάζεται τουλάχιστον είκοσι (20) ώρες την εβδομάδα.</li>
                    <li><span className="secong-tag-info-p-span">Φοιτητές με αναπηρία:</span> Πιστοποιητικό Πάθησης (εφόσον δεν το έχουν καταθέσει με την εγγραφή τους) της ειδικής Επταμελούς Επιτροπής Νοσοκομείου, σύμφωνα με την υπό στοιχεία Φ. 25Ι/171726/Α5/4-11-2019 εγκύκλιο του Υπουργείου Παιδείας και Θρησκευμάτων, που αφορά στην πιστοποίηση από τα ΚΕ.Π.Α.. συγκεκριμένων κατηγοριών υποψηφίων με αναπηρία και ειδικές εκπαιδευτικές ανάγκες ή πασχόντων από σοβαρές παθήσεις.</li>
                    <li><span className="secong-tag-info-p-span">Αθλητές</span> (μόνο όσοι υπάγονται στις ανωτέρω κατηγορίες): Δηλαδή ανήκουν σε αθλητικά σωματεία εγγεγραμμένα στο Μητρώο της Γενικής Γραμματείας Αθλητισμού και για όσα έτη καταλαμβάνουν διακρίσεις, κατά τη διάρκεια των σπουδών τους. Προσκόμιση δικαιολογητικών, εφόσον δεν υπάρχουν στον φάκελο εγγραφής τους,</li>
                </ul>
                
                <p>
                    Οι αιτήσεις με τα δικαιολογητικά των ενδιαφερομένων φοιτητών διαβιβάζονται στην Κοσμητεία της Σχολής Θετικών Επιστημών για την έγκριση υπαγωγής τους σε καθεστώς μερικής φοίτησης, μαζί με τη σχετική εισήγηση της Συνέλευσης του Τμήματος, η οποία θα ορίζει και τον αριθμό των μαθημάτων που θα μπορεί να δηλώνει κάθε φοιτητής μερικής φοίτησης.
                </p>

                <p>
                    Σύμφωνα με της από 7/2/2022 απόφαση της Συνέλευσης του Τμήματός, ο μέγιστος αριθμός  μαθημάτων τα οποία μπορεί να επιλέγει κάθε φοιτητές μερικής φοίτησης  ορίζονται  στο ήμισυ του αριθμού των μαθημάτων που προβλέπει το πρόγραμμα σπουδών ανά ακαδημαϊκό έτος, και συγκεκριμένα:
                </p>

                <ul style={listStyle}>
                    <li>5 μαθήματα για του φοιτητές που βρίσκονται στο 1ο έτος σπουδών,</li>
                    <li>8 μαθήματα για όσους βρίσκονται στο 2ο έτος</li>
                    <li>10 μαθήματα για όσους βρίσκονται στο 3ο και 4ο έτος</li>
                    <li>και 12 για όσους βρίσκονται στο 5ο έτος και άνω.</li>
                </ul>

                <span className="second-tag-info-span">Διευκρινήσεις:</span>

                <ol>
                    <li>Απαιτείται η κατ’ έτος επικαιροποίηση των δικαιολογητικών που προσκομίζει ο εργαζόμενος φοιτητής στη Γραμματεία του Τμήματος φοίτησής του για τη συνέχιση της μερικής φοίτησης, σύμφωνα με τα οριζόμενα στην ισχύουσα νομοθεσία.</li>
                    <li>Η επικαιροποίηση των δικαιολογητικών δεν αφορά τις άλλες κατηγορίες δικαιούχων μερικής φοίτησης.</li>
                    <li>Ο υπολογισμός της ανώτατης διάρκειας φοίτησης, όπως προβλέπεται στις ανωτέρω διατάξεις του νόμου, εφαρμόζεται για όλες τις ως άνω κατηγορίες φοιτητών που υπάγονται σε καθεστώς μερικής φοίτησης.</li>
                    <li>Οι παροχές των φοιτητών που εμπίπτουν σε καθεστώς μερικής φοίτησης είναι ίδιες με αυτές των φοιτητών πλήρους φοίτησης.</li>
                </ol>

            </div>

        </div>
    )
}


function BasicTabs() {
  const [value, setValue] = React.useState(0);

  const handleChange = (event, newValue) => {
    setValue(newValue);
  };

  return (
    <Box sx={{ width: '100%' }}>
        <Box sx={{ borderBottom: 1, borderColor: 'divider' }}>
            <Tabs value={value} onChange={handleChange} aria-label="basic tabs example">
            <Tab label="ΑΝΑΣΤΟΛΗ ΦΟΙΤΗΣΗΣ" {...a11yProps(0)} />
            <Tab label="ΜΕΡΙΚΗ ΦΟΙΤΗΣΗ" {...a11yProps(1)} />
            </Tabs>
        </Box>
        <CustomTabPanel value={value} index={0}>
            <FirstTag/>
        </CustomTabPanel>
        <CustomTabPanel value={value} index={1}>
            <SecondTag/>
        </CustomTabPanel>
    </Box>
  );
}


const StudyInfo = () => {
    return (
        <div>
            <Navbar/>
            <BasicTabs/>
            <ScrollToTop/>
            <Footer/>
        </div>
    )
}

export default StudyInfo